The name entered is already in use. Enter a unique name.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NameNotUnique { get; }
  Visual Basic
Public Shared ReadOnly Property NameNotUnique As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NameNotUnique {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures GeneralFailures Class
  Autodesk.Revit.DB Namespace